The only open view has been deleted because of changes from the Central Model. Open another view and Reload Latest or Synchronize with Central again.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ReloadLatestDeletedLastOpenView { get; }
  Visual Basic
Public Shared ReadOnly Property ReloadLatestDeletedLastOpenView As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ReloadLatestDeletedLastOpenView {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ViewFailures Class
  Autodesk.Revit.DB Namespace